---
kind: property
id: P:Autodesk.Revit.DB.DGNExportOptions.SeedName
source: html/c4990cfe-93c1-34de-667a-d2b7ba735f54.htm
---
# Autodesk.Revit.DB.DGNExportOptions.SeedName Property

The name of the DGN seed.
 Default value of seedName is empty.

## Syntax (C#)
```csharp
public string SeedName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null